/**
 * 门禁人流量 今日
 */
const peopleFlowDay = [
  {
    entrance: '西门',
    carTraffic: [20, 40, 55, 20, 35, 40, 50, 60, 30, 20, 35, 56, 26, 50, 20, 53,],
  },
  {
    entrance: '北1门',
    carTraffic: [30, 70, 30, 45, 15, 50, 73, 29, 12, 22, 75, 47, 25, 55, 52, 35,],
  },
];

/**
 * 门禁人流量 7日
 */
const peopleFlowWeek = [
  {
    entrance: '西门',
    carTraffic: [550, 600, 300, 800, 750, 689, 773,],
  },
  {
    entrance: '北1门',
    carTraffic: [500, 200, 780, 1000, 650, 784, 901,],
  },
];

/**
 * 门禁人流量 30日
 */
const peopleFlowMonth = [
  {
    entrance: '西门',
    carTraffic: [
      500, 600, 300, 800, 750, 689, 773, 
      675, 345, 934, 805, 346, 832, 954,
      569, 876, 745, 934, 754, 963, 867,
      875, 375, 867, 567, 965, 765, 888,
      675, 987,
    ],
  },
  {
    entrance: '北1门',
    carTraffic: [
      500, 200, 780, 1000, 650, 784, 901, 
      547, 968, 765, 576, 800, 576, 875,
      675, 1000, 867, 856, 687, 546, 863,
      867, 856, 687, 987, 857, 607, 956,
      867, 876,
    ],
  },
];

/** 
 * 人员统计： 进园， 出园，在院 
 */
const peopleFlowStat = [
  {
    name: '在院人数',
    data: [20, 30, 10, 40, 20, 15, 5, 25],
  },
  {
    name: '进园人数',
    data: [10, 15, 5, 20, 20, 30, 3, 30],
  },
  {
    name: '出园人数',
    data: [13, 50, 20, 13, 30, 25, 10, 26],
  },
];

/**
 * 现在在院
 */
const atHospital = 957;

/**
 * 人员分布
 */
const patientsLocalities = [
  {name: '一楼', value: 130},
  {name: '二楼', value: 80},
  {name: '三楼', value: 100},
  {name: '四楼', value: 400},
  {name: '五楼', value: 280},
  {name: '六楼', value: 210},
  {name: '七楼', value: 300},
  {name: '八楼', value: 30},
];

const agesStat = {
  "age18": 456,
  "age30": 563,
  "age45": 650,
  "age60": 857,
  "age60b": 935,
};

